#pragma once

// Name: RL, Version: s4


/*!!DEFINE!!*/

/*!!HELPER_DEF!!*/

/*!!HELPER_INC!!*/

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class ProjectX._NetworkNextTypes_X
// 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
class U_NetworkNextTypes_X : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._NetworkNextTypes_X");
		return ptr;
	}



};

// Class ProjectX._SharedHelpers
// 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
class U_SharedHelpers : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._SharedHelpers");
		return ptr;
	}



	int ScoreDeltaFromDefault(class UObject* Object);
	void DrawShadowedText(class UCanvas* Canvas, const struct FString& Text, int ShadowOffsetX, int ShadowOffsetY, int ShadowAlpha);
	bool IsInTransientPackage(class UObject* Obj);
	class APlayerController* GetAPlayerController(class UClass* PlayerControllerClass);
	class UObject* GetDefaultObject(class UClass* ObjClass);
	void DumpUnreferencedAnims();
	struct FString GetLanguageExtension();
};

// Class ProjectX._Types_X
// 0x0048 (FullSize[0x00A8] - InheritedSize[0x0060])
class U_Types_X : public UObject
{
public:
	struct FScriptDelegate                             __OnPriviledgeChecked__Delegate;                           // 0x0060(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_S3LP[0xC];                                     // 0x0060(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __ServiceExecutionDelegate__Delegate;                      // 0x0078(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_V2JS[0xC];                                     // 0x0078(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __OnTimer__Delegate;                                       // 0x0090(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_XV60[0xC];                                     // 0x0090(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX._Types_X");
		return ptr;
	}



	void JoinCredentialsFromString(const struct FString& Credentials, struct FString* JoinName, struct FString* JoinPassword);
	struct FString JoinCredentialsToString(const struct FString& JoinName, const struct FString& JoinPassword);
	struct FString GenerateRandomPrivateMatchPassword();
	struct FString GenerateRandomPrivateMatchName();
	struct FString GenerateRandomName(int Length);
	void OnTimer();
	struct FServerReservationData GetServerReservationData(struct FCheckReservationResponse* Response);
	void ServiceExecutionDelegate(class UPsyNetClientService_X* Service);
	void OnPriviledgeChecked(class UPrivilegeCheck_X* PrivilegeCheck);
};

// Class ProjectX.ActorComponent_X
// 0x0007 (FullSize[0x00A4] - InheritedSize[0x009D])
class UActorComponent_X : public UActorComponent
{
public:
	unsigned char                                      UnknownData_7G32[0x3];                                     // 0x009D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	unsigned long                                      bTick : 1;                                                 // 0x00A0(0x0001) BIT_FIELD
	unsigned long                                      bIgnoreScriptAttach : 1;                                   // 0x00A0(0x0001) BIT_FIELD (Const, Transient)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ActorComponent_X");
		return ptr;
	}



	void Reattach();
	void Tick(float DeltaTime);
	void Detached();
	void Attached();
	void BeginPlay();
};

// Class ProjectX.ExplosionComponent_X
// 0x003C (FullSize[0x00E0] - InheritedSize[0x00A4])
class UExplosionComponent_X : public UActorComponent_X
{
public:
	unsigned char                                      UnknownData_5AQ3[0x4];                                     // 0x00A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              RBVelocityChange;                                          // 0x00A8(0x0004) (Edit)
	float                                              StartRadius;                                               // 0x00AC(0x0004) (Edit)
	float                                              EndRadius;                                                 // 0x00B0(0x0004) (Edit)
	float                                              Speed;                                                     // 0x00B4(0x0004) (Edit)
	float                                              Falloff;                                                   // 0x00B8(0x0004) (Edit)
	unsigned long                                      bPassThroughWorldGeometry : 1;                             // 0x00BC(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bIgnoreInstigator : 1;                                     // 0x00BC(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bDebug : 1;                                                // 0x00BC(0x0001) BIT_FIELD (Edit)
	struct FVector                                     MomentumOffset;                                            // 0x00C0(0x000C) (Edit)
	float                                              LifeTime;                                                  // 0x00CC(0x0004) (Transient)
	TArray<class AActor*>                              DamagedActors;                                             // 0x00D0(0x0010) (Transient, NeedCtorLink)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ExplosionComponent_X");
		return ptr;
	}



	void ProcessHit(class AActor* Victim, const struct FVector& HitLocation, const struct FTraceHitInfo& ExtraHitInfo, float DamageScale);
	void Detached();
};

// Class ProjectX.ExplosionHitHandler_X
// 0x0050 (FullSize[0x00F4] - InheritedSize[0x00A4])
class UExplosionHitHandler_X : public UActorComponent_X
{
public:
	unsigned char                                      UnknownData_R6CC[0x4];                                     // 0x00A4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	float                                              StartTime;                                                 // 0x00A8(0x0004) (Edit)
	float                                              EndTime;                                                   // 0x00AC(0x0004) (Edit)
	class UExplosionCollisionShapes_X*                 CollisionInformation;                                      // 0x00B0(0x0008) (Edit, ExportObject, Component, EditInline)
	unsigned long                                      bIgnoreInstigator : 1;                                     // 0x00B8(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bPassThroughWorldGeometry : 1;                             // 0x00B8(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bOnlyApplyImpulseOnce : 1;                                 // 0x00B8(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bDebug : 1;                                                // 0x00B8(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bPullTowardHitLocation : 1;                                // 0x00B8(0x0001) BIT_FIELD (Edit)
	float                                              Falloff;                                                   // 0x00BC(0x0004) (Edit)
	float                                              RBVelocityChange;                                          // 0x00C0(0x0004) (Edit)
	float                                              Speed;                                                     // 0x00C4(0x0004) (Edit)
	struct FVector                                     MomentumOffset;                                            // 0x00C8(0x000C) (Edit)
	struct FBox                                        GoalWorldBox;                                              // 0x00D4(0x001C) (Transient)
	float                                              LifeTime;                                                  // 0x00F0(0x0004) (Transient)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.ExplosionHitHandler_X");
		return ptr;
	}



	void Destroy();
	void Init(class UActorComponent_X* ExplosionGoal);
	void ProcessHit(class AActor* Victim, const struct FVector& HitLocation, struct FContactInformation* ContactInfo, float DamageScale);
};

// Class ProjectX.FXActor_X
// 0x00C0 (FullSize[0x0328] - InheritedSize[0x0268])
class AFXActor_X : public AActor
{
public:
	class UFXActorEvent_X*                             SpawnState;                                                // 0x0268(0x0008)
	class UFXActorEvent_X*                             ActivationState;                                           // 0x0270(0x0008)
	TArray<struct FFXAttachment>                       Attachments;                                               // 0x0278(0x0010) (Edit, Component, NeedCtorLink)
	TEnumAsByte<ProjectX_EFXLocality>                  Locality;                                                  // 0x0288(0x0001) (Edit)
	unsigned char                                      UnknownData_MKCD[0x3];                                     // 0x0289(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FName                                       SocketOrBoneName;                                          // 0x028C(0x0008) (Edit)
	unsigned long                                      bDeactivateWhenOwnerDestroyed : 1;                         // 0x0294(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bAllowShadowCasting : 1;                                   // 0x0294(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bAutoActivate : 1;                                         // 0x0294(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bRenderInactive : 1;                                       // 0x0294(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bActive : 1;                                               // 0x0294(0x0001) BIT_FIELD (Transient, PrivateWrite)
	unsigned long                                      bHadOwner : 1;                                             // 0x0294(0x0001) BIT_FIELD (Const, Transient, PrivateWrite)
	class AFXActor_X*                                  Parent;                                                    // 0x0298(0x0008) (Edit)
	class AActor*                                      AttachmentActor;                                           // 0x02A0(0x0008) (Transient, PrivateWrite)
	TArray<class UFXActorEvent_X*>                     FXStates;                                                  // 0x02A8(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	TArray<struct FFXActorEventCheck>                  FXEvents;                                                  // 0x02B8(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	float                                              DestroyWaitTime;                                           // 0x02C8(0x0004) (Edit)
	float                                              DestroyTime;                                               // 0x02CC(0x0004) (PrivateWrite)
	class UParameterDispenser_X*                       Parameters;                                                // 0x02D0(0x0008) (Edit, ExportObject, Component, EditInline)
	int                                                EditID;                                                    // 0x02D8(0x0004) (Edit, Const, EditConst, EditorOnly)
	unsigned char                                      UnknownData_PD6Q[0x4];                                     // 0x02DC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FFXEventSubscription>                EventSubscriptions;                                        // 0x02E0(0x0010) (Const, Transient, NeedCtorLink, PrivateWrite)
	class UFXActorEvent_X*                             AnimationEndState;                                         // 0x02F0(0x0008)
	struct FScriptDelegate                             __EventFXStatePushed__Delegate;                            // 0x02F8(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_2YX0[0xC];                                     // 0x02F8(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventFXStatePopped__Delegate;                            // 0x0310(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_M95T[0xC];                                     // 0x0310(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.FXActor_X");
		return ptr;
	}



	void DumpDebugInfo();
	class UFXAttachmentTraitBase_X* GetTrait(class UClass* TraitClass, int AttachmentIdx);
	void OnAnimEnd(class UAnimNodeSequence* SeqNode, float PlayedTime, float ExcessTime);
	void OnAnimPlay(class UAnimNodeSequence* SeqNode);
	void Destroyed();
	void SubscribeState(class UFXActorEvent_X* FXEvent, const struct FScriptDelegate& OnPushed, const struct FScriptDelegate& OnPopped);
	void SetStateEnabled(class UFXActorEvent_X* State, bool bEnable);
	void OnToggle(class USeqAct_Toggle* Action);
	void OnTriggerFXActor_X(class USeqAct_TriggerFXActor_X* SeqAct);
	void Inherit(class AFXActor_X* Other);
	void ResetParticles();
	void StopAllEffects();
	void DeactivateAndDestroy();
	void OnDetached(class UActorComponent* AC);
	void DeactivateFXComponent(class UActorComponent* AC);
	void ActivateFXComponent(class UActorComponent* AC);
	void OnAttached(class UActorComponent* AC);
	int GetComponentsAttachmentIndex(class UActorComponent* ComponentToFind);
	void UpdateFXStates();
	bool IsLocallyControlled();
	class AController* GetControllerOwner();
	void ToggleState(class UFXActorEvent_X* NewState);
	bool RemoveStateForceUpdate(class UFXActorEvent_X* OldState);
	bool RemoveEvent(class UFXActorEvent_X* OldEvent);
	bool RemoveState(class UFXActorEvent_X* OldState);
	void AddEvent(class UFXActorEvent_X* NewEvent);
	void AddState(class UFXActorEvent_X* NewState);
	bool CanRemoveEvent(struct FFXActorEventCheck* InEvent);
	bool IsStateActive(class UFXActorEvent_X* InState);
	void Deactivate();
	void Activate();
	void HandleParentStatePopped(class AFXActor_X* P, class UFXActorEvent_X* Event);
	void HandleParentStatePushed(class AFXActor_X* P, class UFXActorEvent_X* Event);
	void BindTo(class AFXActor_X* ParentFXActor);
	void SetAttachmentActor(class AActor* AttachToActor);
	void PostBeginPlay();
	void AllAttachments(class UClass* ComponentClass, class UActorComponent** OutComponent, int* OutAttachmentIdx);
	class UActorComponent* GetComponentByName(class UClass* ComponentClass, const struct FName& ComponentName);
	void EventFXStatePopped(class AFXActor_X* FXActor, class UFXActorEvent_X* Event);
	void EventFXStatePushed(class AFXActor_X* FXActor, class UFXActorEvent_X* Event);
};

// Class ProjectX.FakeData_X
// 0x0320 (FullSize[0x0380] - InheritedSize[0x0060])
class UFakeData_X : public UObject
{
public:
	int                                                RandomSeed;                                                // 0x0060(0x0004) (PrivateWrite)
	unsigned char                                      UnknownData_V48Y[0x4];                                     // 0x0064(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FFakeData1                                  Data1;                                                     // 0x0068(0x0038) (NeedCtorLink)
	struct FFakeData2                                  Data2;                                                     // 0x00A0(0x0090) (NeedCtorLink)
	struct FFakeData3                                  Data3;                                                     // 0x0130(0x0130) (NeedCtorLink)
	struct FFakeData4                                  Data4;                                                     // 0x0260(0x0120) (NeedCtorLink)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.FakeData_X");
		return ptr;
	}



	int RandomizeValues(class UObject* Target, int InRandomSeed);
	class UFakeData_X* RandomizeFakeData(class UFakeData_X* FakeData, int InRandomSeed);
	class UFakeData_X* GenerateFakeData(int InRandomSeed);
};

// Class ProjectX.FXActorEvent_X
// 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
class UFXActorEvent_X : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.FXActorEvent_X");
		return ptr;
	}



};

// Class ProjectX.FXAttachmentTraitBase_X
// 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
class UFXAttachmentTraitBase_X : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.FXAttachmentTraitBase_X");
		return ptr;
	}



	class UActorComponent* GetComponent();
	void Init();
};

// Class ProjectX.GameEngine_X
// 0x0000 (FullSize[0x0B48] - InheritedSize[0x0B48])
class UGameEngine_X : public UGameEngine
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GameEngine_X");
		return ptr;
	}



	void __GameEngine_X__Construct_735F1A7E4018F462351C69B3DA4C5283(const struct FString& InURL);
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void OnlineSubsystemInitialized();
	void Construct();
};

// Class ProjectX.GameInfo_X
// 0x0058 (FullSize[0x04C8] - InheritedSize[0x0470])
class AGameInfo_X : public AGameInfo
{
public:
	class AGameReplicationInfo*                        GameReplicationInfoArchetype;                              // 0x0470(0x0008) (Edit)
	class APlayerController*                           PlayerControllerArchetype;                                 // 0x0478(0x0008) (Edit)
	class APawn*                                       PawnArchetype;                                             // 0x0480(0x0008) (Edit)
	TArray<struct FPauserData>                         PCPausers;                                                 // 0x0488(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	struct FScriptDelegate                             __EventSpawned__Delegate;                                  // 0x0498(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_JR8T[0xC];                                     // 0x0498(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventInit__Delegate;                                     // 0x04B0(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_UTDX[0xC];                                     // 0x04B0(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GameInfo_X");
		return ptr;
	}



	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void ClientMapLoadFail(const struct FUniqueNetId& PlayerID, const struct FString& MapName);
	void RemovePauser(class APlayerController* PC, bool bForceRemove);
	void AddPauser(class APlayerController* PC);
	void SetPaused(class APlayerController* PC, bool bPause);
	void TogglePause(class APlayerController* PC);
	bool IsPaused(class APlayerController* PC);
	void GetOnlineGameHost();
	class UOnlineGameLanServer_X* GetOnlineGameLanServer();
	class UOnlineGameDedicatedServer_X* GetOnlineGameDedicatedServer();
	class UOnlineGame_Base_X* GetOnlineGame();
	void EndOnlineGame();
	void Logout(class AController* Exiting);
	void GenericPlayerInitialization(class AController* C);
	void DisconnectExistingPlayer(struct FUniqueNetId* PlayerID);
	class APlayerController* Login(const struct FString& Portal, const struct FString& Options, const struct FUniqueNetId& UniqueId, struct FString* ErrorMessage);
	void PreLoginSplitscreen(const struct FUniqueNetId& PrimaryPlayerUniqueId, const struct FString& Options, const struct FString& Address, const struct FUniqueNetId& UniqueId, bool bSupportsAuth, struct FString* ErrorMessage);
	void PreLogin(const struct FString& Options, const struct FString& Address, const struct FUniqueNetId& UniqueId, bool bSupportsAuth, struct FString* ErrorMessage);
	void UpdateGameSettingsCounts();
	void PostBeginPlay();
	bool ProcessServerLogin();
	void RegisterServer();
	class APawn* SpawnDefaultPawnFor(class AController* NewPlayer, class ANavigationPoint* StartSpot);
	void PreBeginPlay();
	class APlayerController* SpawnPlayerController(const struct FVector& SpawnLocation, const struct FRotator& SpawnRotation);
	class UClass* SetGameType(const struct FString& MapName, const struct FString& Options, const struct FString& Portal);
	struct FString GetDefaultGameClassPath(const struct FString& MapName, const struct FString& Options, const struct FString& Portal);
	void PDI(class UClass* ActorClass, bool bOnlybDebug);
	void InitGame(const struct FString& Options, struct FString* ErrorMessage);
	void EventInit(class AGameInfo_X* G, const struct FString& Options);
	void EventSpawned(class AGameInfo_X* G);
};

// Class ProjectX.GameSetting_X
// 0x0004 (FullSize[0x0064] - InheritedSize[0x0060])
class UGameSetting_X : public UObject
{
public:
	unsigned long                                      bHidden : 1;                                               // 0x0060(0x0001) BIT_FIELD (Edit, ProtectedWrite)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GameSetting_X");
		return ptr;
	}



	void PrintDebugInfo(class UDebugDrawer* Drawer);
	bool IsSetting(const struct FName& SettingName);
	void AddGameSettingToList(class UOnlineGameSettings_X* OnlineGameSettings, TArray<class UGameSetting_X*>* GameSettingsArray);
};

// Class ProjectX.GameSettingCategory_X
// 0x0028 (FullSize[0x0088] - InheritedSize[0x0060])
class UGameSettingCategory_X : public UObject
{
public:
	TArray<struct FName>                               SelectedNames;                                             // 0x0060(0x0010) (Edit, NeedCtorLink, PrivateWrite)
	unsigned long                                      bHidden : 1;                                               // 0x0070(0x0001) BIT_FIELD (Edit, Const)
	unsigned long                                      bUseableWhileHidden : 1;                                   // 0x0070(0x0001) BIT_FIELD (Edit, Const)
	unsigned char                                      UnknownData_0POX[0x4];                                     // 0x0074(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UGameSetting_X*>                      GameSettings;                                              // 0x0078(0x0010) (Edit, NeedCtorLink, PrivateWrite)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GameSettingCategory_X");
		return ptr;
	}



	bool __GameSettingCategory_X__GetGameSettingIndex_A405F7A642D1D2A7B18FE0A1DAEA4EBC(class UGameSetting_X* GS);
	void PrintDebugInfo(class UDebugDrawer* Drawer);
	int GetGameSettingIndex(const struct FName& SettingName, bool bIgnoreHidden, TArray<class UGameSetting_X*>* FilterLocal_C7EF81F94A8E502122615A9926D38F3D);
	bool HasSetting(const struct FName& SettingName);
	void GetSelectedGameSettings(TArray<class UGameSetting_X*>* SelectedGameSettings);
	class UGameSetting_X* GetFirstSelectedGameSetting();
	void ClearSelected();
	void AddSelectedSetting(const struct FName& NewSelectedName);
	void SetGameSettings(TArray<class UGameSetting_X*> NewGameSettings);
};

// Class ProjectX.GameViewportClient_X
// 0x0068 (FullSize[0x02B0] - InheritedSize[0x0248])
class UGameViewportClient_X : public UGameViewportClient
{
public:
	unsigned long                                      bHandCursor : 1;                                           // 0x0248(0x0001) BIT_FIELD (Transient)
	unsigned long                                      bMuteSoundOnFocusLost : 1;                                 // 0x0248(0x0001) BIT_FIELD (Transient)
	int                                                MaxSplitScreenPlayers;                                     // 0x024C(0x0004) (Const, Config)
	struct FScriptDelegate                             __EventLocalPlayerJoin__Delegate;                          // 0x0250(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_HX12[0xC];                                     // 0x0250(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventLocalPlayerLeave__Delegate;                         // 0x0268(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_PTNH[0xC];                                     // 0x0268(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventNotifyConnectionError__Delegate;                    // 0x0280(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_SSLZ[0xC];                                     // 0x0280(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventPrimaryPlayerChange__Delegate;                      // 0x0298(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_2ZEO[0xC];                                     // 0x0298(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GameViewportClient_X");
		return ptr;
	}



	void OnPrimaryPlayerSwitch(class ULocalPlayer* OldPrimaryPlayer, class ULocalPlayer* NewPrimaryPlayer);
	bool ForceRemovePlayer(class ULocalPlayer* ExPlayer);
	bool RemovePlayer(class ULocalPlayer* ExPlayer);
	bool RemovePlayerByID(int ControllerId);
	void SetHardwareMouseCursorVisibility(bool bIsVisible);
	void NotifyConnectionError(TEnumAsByte<Engine_EProgressMessageType> MessageType, const struct FString& Message, const struct FString& Title);
	void SetProgressMessage(TEnumAsByte<Engine_EProgressMessageType> MessageType, const struct FString& Message, const struct FString& Title, bool bIgnoreFutureNetworkMessages);
	class ULocalPlayer* CreatePlayer(int ControllerId, struct FString* OutError, bool bSpawnActor);
	void NotifyPlayerRemoved(int PlayerIndex, class ULocalPlayer* RemovedPlayer);
	void NotifyPlayerAdded(int PlayerIndex, class ULocalPlayer* AddedPlayer);
	bool ShouldMuteAudioWhenUnfocused();
	bool PlatformSupportsMuteOnFocusLostOption();
	bool IsGameRecordingEnabled();
	float GetDefaultSafeZone();
	void FlashWindow();
	void SaveCurrentWindowState();
	void SaveWindowState(int ResX, int ResY, bool bFullScreen, bool bBorderless, bool bVsync);
	bool GetAvailableRefreshRates(TArray<int>* RefreshRates);
	bool GetAvailableResolutions(TArray<struct FIntPoint>* Resolutions);
	bool GetAvailableResolutionsStr(TArray<struct FString>* Resolutions);
	bool IsBorderlessViewport();
	struct FIntPoint GetViewportSizePoint();
	struct FString GetViewportSizeStr();
	class UGameViewportClient_X* GetInstance();
	void EventPrimaryPlayerChange(class ULocalPlayer* OldPrimaryPlayer, class ULocalPlayer* NewPrimaryPlayer);
	void EventNotifyConnectionError(TEnumAsByte<Engine_EProgressMessageType> MessageType, const struct FString& Title, const struct FString& Message);
	void EventLocalPlayerLeave(class ULocalPlayer* OldPlayer);
	void EventLocalPlayerJoin(class ULocalPlayer* NewPlayer);
};

// Class ProjectX.GFxDataRow_X
// 0x0034 (FullSize[0x0094] - InheritedSize[0x0060])
class UGFxDataRow_X : public UObject
{
public:
	struct FName                                       TableName;                                                 // 0x0060(0x0008) (Edit, Const)
	struct FName                                       PrimaryKeyName;                                            // 0x0068(0x0008) (Edit, Const)
	class UClass*                                      ProxyClass;                                                // 0x0070(0x0008) (Edit, Const)
	unsigned long                                      bLevelTransitionPersistent : 1;                            // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned char                                      UnknownData_FJ2Q[0x4];                                     // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UObject*                                     ProxyObject;                                               // 0x0080(0x0008) (Const, Transient)
	class UGFxShell_X*                                 Shell;                                                     // 0x0088(0x0008) (Const, Transient)
	int                                                RowIndex;                                                  // 0x0090(0x0004) (Const, Transient)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxDataRow_X");
		return ptr;
	}



	class UGFxObject* FlashEventObject();
	struct FString FlashEventString();
	float FlashEventFloat();
	int FlashEventInt();
	void FlashEventVoid();
	void SetProxy(class UObject* InProxyObject);
	void OnRemoved();
	void OnShellSet();
};

// Class ProjectX.GFxDataSingleton_X
// 0x0004 (FullSize[0x0098] - InheritedSize[0x0094])
class UGFxDataSingleton_X : public UGFxDataRow_X
{
public:
	unsigned char                                      UnknownData_KH5O[0x4];                                     // 0x0094(0x0004) MISSED OFFSET (PADDING)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxDataSingleton_X");
		return ptr;
	}



};

// Class ProjectX.GFxShell_X
// 0x0098 (FullSize[0x0130] - InheritedSize[0x0098])
class UGFxShell_X : public UGFxDataSingleton_X
{
public:
	class UGFxMoviePlayer_X*                           MoviePlayerArchetype;                                      // 0x0098(0x0008) (Edit)
	class ULocalPlayer_X*                              Player;                                                    // 0x00A0(0x0008) (Const, Transient)
	unsigned long                                      bGamePaused : 1;                                           // 0x00A8(0x0001) BIT_FIELD (DataBinding)
	unsigned long                                      bWasFullscreen : 1;                                        // 0x00A8(0x0001) BIT_FIELD (Const, Transient)
	float                                              LeftX;                                                     // 0x00AC(0x0004) (DataBinding)
	float                                              LeftY;                                                     // 0x00B0(0x0004) (DataBinding)
	float                                              RightX;                                                    // 0x00B4(0x0004) (DataBinding)
	float                                              RightY;                                                    // 0x00B8(0x0004) (DataBinding)
	unsigned char                                      UnknownData_EZ5H[0x4];                                     // 0x00BC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<class UGFxMoviePlayer_X*>                   Movies;                                                    // 0x00C0(0x0010) (Const, Transient, NeedCtorLink)
	class UGFxDataStore_X*                             DataStore;                                                 // 0x00D0(0x0008) (Const, ExportObject, Component, EditInline)
	TEnumAsByte<Engine_EInputPlatformType>             InputType;                                                 // 0x00D8(0x0001) (Const, Transient)
	TEnumAsByte<Core_EOnlinePlatform>                  OnlinePlatformType;                                        // 0x00D9(0x0001) (DataBinding)
	unsigned char                                      UnknownData_066K[0x6];                                     // 0x00DA(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	class UOnlineSubsystem*                            OnlineSub;                                                 // 0x00E0(0x0008) (Edit)
	struct FScriptDelegate                             __EventInputCaptureChanged__Delegate;                      // 0x00E8(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_W6L2[0xC];                                     // 0x00E8(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventInputTypeChanged__Delegate;                         // 0x0100(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_XQLK[0xC];                                     // 0x0100(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventReceivedInput__Delegate;                            // 0x0118(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_S2XZ[0xC];                                     // 0x0118(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxShell_X");
		return ptr;
	}



	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void SetMouseKeyPressed(const struct FName& Key, bool bPressed);
	void HandleOnlineSubSet();
	void SetAllowAnyPlayerInput(bool bAllow);
	void HandlePauseChanged();
	void OnShowKeyboardCanceled();
	void OnShowKeyboardComplete(const struct FString& NewText);
	void HandleShowKeyboardComplete(const struct FString& NewText, bool bCanceled);
	struct FString PasteFromClipboard();
	void CopyToClipboard(const struct FString& ClipboardText);
	void HideKeyboard();
	bool ShowKeyboard(const struct FString& TitleText, const struct FString& DescriptionText, bool bIsPassword, const struct FString& DefaultText, int MaxLength);
	void SetGamePaused(bool bPaused);
	void ExitToMainMenu();
	void ExitGame();
	void HandleMovieInputCaptureChanged(class UGFxMoviePlayer_X* MoviePlayer);
	void TriggerDataCallbacks();
	void Tick(float DeltaTime);
	void OnMovieClosed(class UGFxMoviePlayer_X* Movie);
	void OnMovieStarted(class UGFxMoviePlayer_X* Movie);
	void StopMovie(class UGFxMoviePlayer_X* Movie);
	void StartMovie(class UGFxMoviePlayer_X* Movie);
	void Stop();
	void OnStart();
	void Start(class ULocalPlayer_X* InPlayer);
	void EventReceivedInput(class UGFxShell_X* InShell);
	void EventInputTypeChanged(class UGFxShell_X* InShell);
	void EventInputCaptureChanged(class UGFxShell_X* InShell);
};

// Class ProjectX.GFxDataStore_X
// 0x0074 (FullSize[0x00E4] - InheritedSize[0x0070])
class UGFxDataStore_X : public UComponent
{
public:
	TArray<struct FGFxDataStoreTable>                  Tables;                                                    // 0x0070(0x0010) (Const, Transient, NeedCtorLink)
	TArray<struct FGFxDirtyTable>                      DirtyTables;                                               // 0x0080(0x0010) (Const, Transient, NeedCtorLink)
	struct FMap_Mirror                                 ObjectNameToTable;                                         // 0x0090(0x0050) (Const, Native, Transient)
	unsigned long                                      bDebugGetValue : 1;                                        // 0x00E0(0x0001) BIT_FIELD (Edit)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxDataStore_X");
		return ptr;
	}



	void ExportFakeData(const struct FName& InTableName);
	void PrintData(const struct FName& InTableName);
	int GetObjectRow(class UGFxDataRow_X* O);
	void AllObjectsOfType(class UClass* BaseClass, class UGFxDataRow_X** OutObject);
	void AllObjects(class UClass* ObjClass, class UGFxDataRow_X** OutObject, int* Row);
	class UGFxDataRow_X* GetObjectByPrimaryKey(class UClass* ObjClass, const struct FString& Value);
	class UGFxDataRow_X* GetObject(class UClass* ObjClass, int Row);
	void RemoveObject(class UGFxDataRow_X* O);
	void BindObject(class UGFxDataRow_X* Object, int Row);
	class UGFxDataRow_X* CreateObject(class UClass* ObjClass, int Row, int* PlacedRow);
	void RemoveAllObjects(class UClass* ObjClass);
	void SetObjectCount(class UClass* ObjClass, int Count);
	int GetObjectCount(class UClass* ObjClass);
	void EmptyTables();
	void EmptyTable(const struct FName& Table);
	void RemoveRow(const struct FName& Table, int Row);
	void SetRowCount(const struct FName& Table, int Count);
	int GetRowCount(const struct FName& Table);
	struct FASValue GetValue(const struct FName& Table, int Row, const struct FName& Column);
	int GetObjectIndex(class UGFxDataRow_X* TargetObject);
	void SetASValue(const struct FName& Table, int Row, const struct FName& Column, struct FASValue* Value);
	void SetTextureValue(const struct FName& Table, int Row, const struct FName& Column, class UTexture* Value);
	void SetStringValue(const struct FName& Table, int Row, const struct FName& Column, const struct FString& Value);
	void SetQWordValue(const struct FName& Table, int Row, const struct FName& Column);
	void SetFloatValue(const struct FName& Table, int Row, const struct FName& Column, float Value);
	void SetIntValue(const struct FName& Table, int Row, const struct FName& Column, int Value);
	void SetBoolValue(const struct FName& Table, int Row, const struct FName& Column, bool Value);
	void SetDirty(const struct FName& InTableName, int RowNum, const struct FName& Value);
};

// Class ProjectX.GFxEngine_X
// 0x0078 (FullSize[0x0190] - InheritedSize[0x0118])
class UGFxEngine_X : public UGFxEngine
{
public:
	class UGFxShell_X*                                 ShellArchetype;                                            // 0x0118(0x0008) (PrivateWrite)
	TArray<class UGFxShell_X*>                         Shells;                                                    // 0x0120(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	TArray<struct FDirtyObject>                        DirtyObjects;                                              // 0x0130(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	unsigned long                                      bAnyShellHasInput : 1;                                     // 0x0140(0x0001) BIT_FIELD (Transient, PrivateWrite)
	TEnumAsByte<Engine_EInputPlatformType>             AvailableGamepadType;                                      // 0x0144(0x0001) (Const, Transient)
	unsigned char                                      UnknownData_GZM5[0x3];                                     // 0x0145(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FScriptDelegate                             __EventShellCreated__Delegate;                             // 0x0148(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_ZBZS[0xC];                                     // 0x0145(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventAvailableGamepadTypeChanged__Delegate;              // 0x0160(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_QL6U[0xC];                                     // 0x0160(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventGameSessionEnded__Delegate;                         // 0x0178(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_ARS2[0xC];                                     // 0x0178(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxEngine_X");
		return ptr;
	}



	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void OnGameSessionEnded();
	void GetFlashKey(const struct FName& UnrealKey, int* KeyCode, int* MouseButton);
	void UpdateHardwareMouseCursorVisibility();
	void HandleShellInputTypeChanged(class UGFxShell_X* InShell);
	void HandleGFxEnabledChanged(class UGameViewportClient* GVC);
	void HandleShellInputCaptureChanged(class UGFxShell_X* InShell);
	void FlushDirtyObjects();
	void Tick(float DeltaTime);
	class UGFxShell_X* FindShell(class ULocalPlayer_X* ForPlayer);
	void OnShellDestroyed(class UGFxShell_X* Shell);
	void DestroyShell(class ULocalPlayer* ForPlayer);
	class UGFxShell_X* CreateShell();
	class UGFxShell_X* GetShell(class ULocalPlayer_X* ForPlayer);
	void SetShellArchetype(class UGFxShell_X* InShellArchetype);
	class UGFxEngine_X* GetInstance(class UClass* Type);
	void EventGameSessionEnded();
	void EventAvailableGamepadTypeChanged(class UGFxEngine_X* Engine);
	void EventShellCreated(class UGFxEngine_X* Engine, class UGFxShell_X* Shell);
};

// Class ProjectX.GFxMoviePlayer_X
// 0x0120 (FullSize[0x0338] - InheritedSize[0x0218])
class UGFxMoviePlayer_X : public UGFxMoviePlayer
{
public:
	class UGFxShell_X*                                 Shell;                                                     // 0x0218(0x0008) (Const, Transient)
	class UGFxDataStore_X*                             DataStore;                                                 // 0x0220(0x0008) (Const, ExportObject, Transient, Component, EditInline)
	TArray<class UGFxDataCallback_X*>                  DataCallbacks;                                             // 0x0228(0x0010) (Const, Transient, NeedCtorLink)
	TArray<class UGFxObjectReference_X*>               ActionScriptClasses;                                       // 0x0238(0x0010) (Const, Transient, NeedCtorLink)
	struct FMap_Mirror                                 ActionScriptClassMap;                                      // 0x0248(0x0050) (Const, Native, Transient)
	TArray<struct FString>                             CursorScenes;                                              // 0x0298(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	TArray<struct FString>                             InputScenes;                                               // 0x02A8(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	TArray<struct FString>                             CaptureScenes;                                             // 0x02B8(0x0010) (Transient, NeedCtorLink, PrivateWrite)
	struct FName                                       DebugTableCallback;                                        // 0x02C8(0x0008) (Edit)
	struct FName                                       DebugColumnCallback;                                       // 0x02D0(0x0008) (Edit)
	class UGFxObjectReference_X*                       ShellHooksClass;                                           // 0x02D8(0x0008) (Const, Transient)
	TArray<class UGFxSoundPack_X*>                     LoadedSoundPacks;                                          // 0x02E0(0x0010) (Transient, NeedCtorLink)
	struct FScriptDelegate                             __EventStarted__Delegate;                                  // 0x02F0(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_BCEP[0xC];                                     // 0x02F0(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventClosed__Delegate;                                   // 0x0308(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_BK5M[0xC];                                     // 0x0308(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FScriptDelegate                             __EventInputCaptureChanged__Delegate;                      // 0x0320(0x000C) ELEMENT_SIZE_MISMATCH (NeedCtorLink)
	unsigned char                                      UnknownData_QZ2W[0xC];                                     // 0x0320(0x000C) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxMoviePlayer_X");
		return ptr;
	}



	void PrintDebugInfo(class UDebugDrawer* Drawer);
	void SetAllowAnyPlayerInput(bool bAllow);
	bool PopString(TArray<struct FString>* Items, const struct FString& Value);
	void SetGlobalRTCP(const struct FName& Key, float Value);
	void StopAllSounds(class UGFxSoundPack_X* SoundPack);
	void StopSound(const struct FName& EventName);
	void PlaySound(const struct FName& EventName);
	void PlaySoundFromTheme(const struct FName& EventName, const struct FName& SoundThemeName);
	class AActor* GetSoundSource();
	void UpdateCursorVisibility();
	void SetCaptureAllInput(bool bNewCaptureInput, const struct FString& SceneName);
	void SetReceiveInput(bool bNewReceiveInput, const struct FString& SceneName);
	void SetCursorVisible(bool bVisible, const struct FString& SceneName);
	void InitShellHooks();
	void InitDataHooks();
	void OnClose();
	bool Start(bool StartPaused);
	void EventInputCaptureChanged(class UGFxMoviePlayer_X* Player);
	void EventClosed(class UGFxMoviePlayer_X* Player);
	void EventStarted(class UGFxMoviePlayer_X* Player);
};

// Class ProjectX.GFxObjectReference_X
// 0x0030 (FullSize[0x0090] - InheritedSize[0x0060])
class UGFxObjectReference_X : public UObject
{
public:
	int                                                Value[0xC];                                                // 0x0060(0x0030) (Const, Native)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxObjectReference_X");
		return ptr;
	}



};

// Class ProjectX.GFxDataCallback_X
// 0x0015 (FullSize[0x00A5] - InheritedSize[0x0090])
class UGFxDataCallback_X : public UGFxObjectReference_X
{
public:
	struct FName                                       Table;                                                     // 0x0090(0x0008) (Transient)
	int                                                Row;                                                       // 0x0098(0x0004) (Transient)
	struct FName                                       Column;                                                    // 0x009C(0x0008) (Transient)
	TEnumAsByte<ProjectX_EDataCallbackType>            Type;                                                      // 0x00A4(0x0001) (Transient)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxDataCallback_X");
		return ptr;
	}



};

// Class ProjectX.GFxSoundPack_X
// 0x0024 (FullSize[0x0084] - InheritedSize[0x0060])
class UGFxSoundPack_X : public UObject
{
public:
	struct FString                                     ExportClassName;                                           // 0x0060(0x0010) (Edit, NeedCtorLink)
	TArray<struct FSoundPackSoundRef>                  Sounds;                                                    // 0x0070(0x0010) (Edit, Const, NeedCtorLink, PrivateWrite)
	unsigned long                                      bHasSubtitles : 1;                                         // 0x0080(0x0001) BIT_FIELD (Edit)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.GFxSoundPack_X");
		return ptr;
	}



	bool ToggleSound(int Idx, class AActor* Target, bool bPlay);
	void StopAll(class AActor* Target);
	bool StopSound(const struct FName& SoundName, class AActor* Target);
	bool PlaySound(const struct FName& SoundName, class AActor* Target);
};

// Class ProjectX.LensFlareComponent_X
// 0x0080 (FullSize[0x033C] - InheritedSize[0x02BC])
class ULensFlareComponent_X : public ULensFlareComponent
{
public:
	unsigned char                                      UnknownData_HXLM[0x4];                                     // 0x02BC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	struct FPointer                                    VfTable_IISetParameter;                                    // 0x02C0(0x0008) (Const, Native, NoExport)
	struct FRawDistributionFloat                       AlphaOverTime;                                             // 0x02C8(0x0028) (Edit, Component, NeedCtorLink)
	struct FRawDistributionVector                      ColorOverTime;                                             // 0x02F0(0x0028) (Edit, Component, NeedCtorLink)
	TArray<struct FLensFlareFloatParamCurve>           MaterialFloatParamValuesOverTime;                          // 0x0318(0x0010) (Edit, Component, NeedCtorLink)
	struct FName                                       SourceColorParamName;                                      // 0x0328(0x0008) (Edit, Const)
	struct FName                                       SourceColorAlphaParamName;                                 // 0x0330(0x0008) (Edit, Const)
	float                                              AttachTime;                                                // 0x0338(0x0004) (Transient)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.LensFlareComponent_X");
		return ptr;
	}



	void SetActorParameter(const struct FName& Key, class AActor* Value);
	void SetLinearColorParameter(const struct FName& Key, const struct FLinearColor& Value);
	void SetVectorParameter(const struct FName& Key, const struct FVector& Value);
	void SetFloatParameter(const struct FName& Key, float Value);
	void SetNameParameter(const struct FName& Key, const struct FName& Value);
};

// Class ProjectX.NetworkNextClient_X
// 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
class UNetworkNextClient_X : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.NetworkNextClient_X");
		return ptr;
	}



	void FlagSession();
	struct FNetworkNextStats GetStats();
	TEnumAsByte<ProjectX_ENetworkNextState> GetState();
};

// Class ProjectX.NetworkNextServer_X
// 0x0000 (FullSize[0x0060] - InheritedSize[0x0060])
class UNetworkNextServer_X : public UObject
{
public:


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.NetworkNextServer_X");
		return ptr;
	}



	void Upgrade(class UNetConnection* Connection, const struct FString& SessionTag);
	bool IsEnabled();
};

// Class ProjectX.NNXErrors_X
// 0x0008 (FullSize[0x0088] - InheritedSize[0x0080])
class UNNXErrors_X : public UErrorList
{
public:
	class UErrorType*                                  SwitchServiceMaintenance;                                  // 0x0080(0x0008) (Const)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.NNXErrors_X");
		return ptr;
	}



};

// Class ProjectX.OnlineConfig_X
// 0x0018 (FullSize[0x0078] - InheritedSize[0x0060])
class UOnlineConfig_X : public UObject
{
public:
	unsigned long                                      bAllowOnServer : 1;                                        // 0x0060(0x0001) BIT_FIELD (Edit)
	unsigned char                                      UnknownData_U9ZE[0x4];                                     // 0x0064(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FModifierSubscription>               AllSubscriptions;                                          // 0x0068(0x0010) (Transient, NeedCtorLink)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.OnlineConfig_X");
		return ptr;
	}



	void UnsubscribeModifiers();
	void ModifyObjects(class UClass* ObjClass, const struct FScriptDelegate& ApplyCallback, const struct FScriptDelegate& ResetCallback);
	void Undo();
	void Apply();
};

// Class ProjectX.BeaconConfig_X
// 0x0018 (FullSize[0x0090] - InheritedSize[0x0078])
class UBeaconConfig_X : public UOnlineConfig_X
{
public:
	unsigned long                                      bUdpPingRegions : 1;                                       // 0x0078(0x0001) BIT_FIELD (Config)
	unsigned long                                      bUdpPingMetrics : 1;                                       // 0x0078(0x0001) BIT_FIELD (Config)
	int                                                MaxPingsPerAddress;                                        // 0x007C(0x0004) (Config)
	int                                                MaxPingsWindowSeconds;                                     // 0x0080(0x0004) (Config)
	int                                                StatsLogDelaySeconds;                                      // 0x0084(0x0004) (Config)
	float                                              WaitForPongSeconds;                                        // 0x0088(0x0004) (Config)
	int                                                PingsPerSecond;                                            // 0x008C(0x0004) (Config)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.BeaconConfig_X");
		return ptr;
	}



};

// Class ProjectX.CrossplayConfig_X
// 0x0020 (FullSize[0x0098] - InheritedSize[0x0078])
class UCrossplayConfig_X : public UOnlineConfig_X
{
public:
	TArray<struct FCrossplayGroup>                     Groups;                                                    // 0x0078(0x0010) (Edit, NeedCtorLink)
	TArray<struct FCrossplayGroup>                     DisabledCrossplayGroups;                                   // 0x0088(0x0010) (Edit, NeedCtorLink)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.CrossplayConfig_X");
		return ptr;
	}



	bool CanInteractWithCrossplayDisabled(TEnumAsByte<Core_EOnlinePlatform> Platform1, TEnumAsByte<Core_EOnlinePlatform> Platform2, TArray<TEnumAsByte<Core_EOnlinePlatform>>* ArrayResultLocal_E393E93F4031CA04A1A9FF8325F4F676);
	TArray<TEnumAsByte<Core_EOnlinePlatform>> GetDisabledCrossplayGroup(TEnumAsByte<Core_EOnlinePlatform> PlayerPlatform, TArray<TEnumAsByte<Core_EOnlinePlatform>>* ArrayInitializer_638B32A145E29F1C4DDD449B2449FDB9);
	bool PlatformsShareGroup(TEnumAsByte<Core_EOnlinePlatform> Platform1, TEnumAsByte<Core_EOnlinePlatform> Platform2);
};

// Class ProjectX.EventRecorderConfig_X
// 0x002C (FullSize[0x00A4] - InheritedSize[0x0078])
class UEventRecorderConfig_X : public UOnlineConfig_X
{
public:
	unsigned long                                      bEnabled : 1;                                              // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bSeparatePlayerIDs : 1;                                    // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bExcludePlayerIDs : 1;                                     // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned char                                      UnknownData_6E0I[0x4];                                     // 0x007C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
	TArray<struct FName>                               DisabledEvents;                                            // 0x0080(0x0010) (Edit, NeedCtorLink)
	class UClass*                                      EventRecorderClass;                                        // 0x0090(0x0008) (Edit)
	float                                              PlayerNetMetricsPeriod;                                    // 0x0098(0x0004) (Edit)
	int                                                MaxUnstableConnections;                                    // 0x009C(0x0004) (Edit)
	int                                                UnstableConnectionsTimePeriodSeconds;                      // 0x00A0(0x0004) (Edit)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.EventRecorderConfig_X");
		return ptr;
	}



};

// Class ProjectX.LocalizationConfig_X
// 0x0010 (FullSize[0x0088] - InheritedSize[0x0078])
class ULocalizationConfig_X : public UOnlineConfig_X
{
public:
	TArray<struct FLocOverride>                        Overrides;                                                 // 0x0078(0x0010) (NeedCtorLink)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.LocalizationConfig_X");
		return ptr;
	}



	void Apply();
};

// Class ProjectX.NetworkNextConfig_X
// 0x002C (FullSize[0x00A4] - InheritedSize[0x0078])
class UNetworkNextConfig_X : public UOnlineConfig_X
{
public:
	float                                              ClientLibraryProbability;                                  // 0x0078(0x0004) (Edit)
	float                                              ClientDriverProbability;                                   // 0x007C(0x0004) (Edit)
	float                                              ServerLibraryProbability;                                  // 0x0080(0x0004) (Edit)
	float                                              SessionProbability;                                        // 0x0084(0x0004) (Edit)
	TArray<struct FString>                             UserCountryCodes;                                          // 0x0088(0x0010) (Edit, NeedCtorLink)
	int                                                SocketSendBufferBytes;                                     // 0x0098(0x0004) (Edit)
	int                                                SocketReceiveBufferBytes;                                  // 0x009C(0x0004) (Edit)
	unsigned long                                      bEnableDocsisTagging : 1;                                  // 0x00A0(0x0001) BIT_FIELD (Edit)


	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class ProjectX.NetworkNextConfig_X");
		return ptr;
	}



	void Undo();
	void Apply();
};

// Class ProjectX.PsyNetConfig_X
// 0x0014 (FullSize[0x008C] - InheritedSize[0x0078])
class UPsyNetConfig_X : public UOnlineConfig_X
{
public:
	unsigned long                                      bAllowPerCon : 1;                                          // 0x0078(0x0001) BIT_FIELD (Edit, Config)
	unsigned long                                      bRequiresPerCon : 1;                                       // 0x0078(0x0001) BIT_FIELD (Config)
	unsigned long                                      bAllowPsyNetParty : 1;                                     // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bSendPingMessage : 1;                                      // 0x0078(0x0001) BIT_FIELD (Edit, Config)
	unsigned long                                      bUploadServerBugReports : 1;                               // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bAllowServerBacktraceUploads : 1;                          // 0x0078(0x0001) BIT_FIELD (Edit)
	unsigned long                                      bAllowServerBacktraceLogUploads : 1;                       // 0x0078(0x0001) BIT_FIELD (Edit)
